БухЭксп/Enums/CW_РеквизитыКоносамента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеквизитыКоносамента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Букинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесБрутто</Name>
					<Comment>Брутто вес груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесНетто</Name>
					<Comment>Нетто вес груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесТары</Name>
					<Comment>Вес тары в килограммах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГармонизированныйКод</Name>
					<Comment>Код груза в соответствии с классификацией ВТО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаПогрузкиНаСудно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Извещать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассОпасности</Name>
					<Comment>Классификация опасного груза IMO CLASS/UN NO</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Comment>Количество упаковок в грузовой единице</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Линия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем груза в м3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОписаниеГруза</Name>
					<Comment>Описание груза </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пломба</Name>
					<Comment>Номер пломбы грузовой единицы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортПерегрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалПерегрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
					<Comment>Наименование упаковки груза в грузовой единице </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_РеквизитыКоносамента/Ext/ManagerModule.bsl
Функция ПолучитьСоответствияИменРеквизитов() Экспорт
	
	РеквизитыКоносамента = Перечисления.CW_РеквизитыКоносамента;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(РеквизитыКоносамента.НомерКоносамента, "Наименование");
	Соответствие.Вставить(РеквизитыКоносамента.ДатаКоносамента, "Дата");
	Соответствие.Вставить(РеквизитыКоносамента.Букинг, "Букинг");
	Соответствие.Вставить(РеквизитыКоносамента.ВидКоносамента, "ВидКоносамента");
	Соответствие.Вставить(РеквизитыКоносамента.ТипКоносамента, "ТипКоносамента");
	Соответствие.Вставить(РеквизитыКоносамента.Организация, "Организация");
	Соответствие.Вставить(РеквизитыКоносамента.Линия, "Линия");
	Соответствие.Вставить(РеквизитыКоносамента.Судно, "Судно");
	Соответствие.Вставить(РеквизитыКоносамента.Рейс, "Рейс");
	Соответствие.Вставить(РеквизитыКоносамента.ДоговорСКлиентом, "Договор");
	Соответствие.Вставить(РеквизитыКоносамента.ПортОтправки, "ПортОтправки");
	Соответствие.Вставить(РеквизитыКоносамента.ТерминалОтправки, "ТерминалОтправки");
	Соответствие.Вставить(РеквизитыКоносамента.ПортВыгрузки, "ПортВыгрузки");
	Соответствие.Вставить(РеквизитыКоносамента.ТерминалВыгрузки, "ТерминалВыгрузки");
	Соответствие.Вставить(РеквизитыКоносамента.ПортПерегрузки, "ПортПерегрузки");
	Соответствие.Вставить(РеквизитыКоносамента.ТерминалПерегрузки, "ТерминалПерегрузки");
	Соответствие.Вставить(РеквизитыКоносамента.Отправитель, "Отправитель");
	Соответствие.Вставить(РеквизитыКоносамента.Получатель, "Получатель");
	Соответствие.Вставить(РеквизитыКоносамента.Извещать, "Извещать");
	Соответствие.Вставить(РеквизитыКоносамента.Доставка, "Доставка"); 
	Соответствие.Вставить(РеквизитыКоносамента.ДатаПогрузкиНаСудно, "ДатаПогрузкиНаСудно"); 
	
	
	//Реквизиты табичной части
	Соответствие.Вставить(РеквизитыКоносамента.Упаковка, 			"СтрокаТаблицы.Упаковка");
	Соответствие.Вставить(РеквизитыКоносамента.КоличествоУпаковок,  "СтрокаТаблицы.КоличествоУпаковок");
	Соответствие.Вставить(РеквизитыКоносамента.Пломба, 				"СтрокаТаблицы.Пломба");
	Соответствие.Вставить(РеквизитыКоносамента.ОписаниеГруза, 		"СтрокаТаблицы.ОписаниеГруза");
	Соответствие.Вставить(РеквизитыКоносамента.ВесТары, 			"СтрокаТаблицы.ВесТары");
	Соответствие.Вставить(РеквизитыКоносамента.ВесНетто, 			"СтрокаТаблицы.ВесНетто");
	Соответствие.Вставить(РеквизитыКоносамента.Объем, 				"СтрокаТаблицы.Объем");
	
	Возврат Соответствие;
	
КонецФункции
